app/views/posts/edit.html.erb

      <p>
		  <%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => "Select One"}%>
---
SELECT "categories".* FROM "categories"