app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", 2017-10-06 17:01:54 UTC], ["updated_at", 2017-10-06 17:01:54 UTC]]
---
  def create
     @category = Category.new(category_params)
     if current_user.admin? && @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Animals"], ["updated_at", 2017-10-06 22:22:39 UTC], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])

    if @category.update_attributes(category_params)