app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @posts = Post.paginate(page: params[:page])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at", "category_id", "picture") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  @post = current_user.posts.build(post_params)
  if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def edit
 @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "This is amazing i have learn vim within three hours Hurray!!! man"], ["updated_at", 2017-10-06 10:25:11 UTC], ["id", 4]]
---
def update
  @post = Post.find(params[:id])
  if @post.update_attributes(post_params)