app/views/categories/show.html.erb


           <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"